app/controllers/admin/req_breakdowns_controller.rb

  def index
    @req_breakdowns = ReqBreakdown.find(:all)
---
SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 2)