app/controllers/admin/req_breakdowns_controller.rb

SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`previous_breakdown_id` IS NULL)
---
  def index
    @req_breakdowns = ReqBreakdown.find_all_by_previous_breakdown_id(nil)

SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)
---
  def show
    @req_breakdown = ReqBreakdown.find(params[:id])

SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)
---
  def edit
    @req_breakdown = ReqBreakdown.find(params[:id])

INSERT INTO `req_breakdowns` (`created_at`, `updated_at`, `requirement_level_id`, `next_breakdown_id`, `previous_breakdown_id`) VALUES('2010-02-26 03:45:27', '2010-02-26 03:45:27', NULL, NULL, NULL)
---
  def create
    @req_breakdown = ReqBreakdown.new(params[:req_breakdown])

    respond_to do |format|
      if @req_breakdown.save

SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)
---
  def update
    @req_breakdown = ReqBreakdown.find(params[:id])

SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)
DELETE FROM `req_breakdowns` WHERE `id` = 1
---
  def destroy
    @req_breakdown = ReqBreakdown.find(params[:id])
    @req_breakdown.destroy