app/controllers/admin/requirement_levels_controller.rb

  def index
    @requirement_levels = RequirementLevel.all
---
SELECT * FROM `requirement_levels`

  def show
    @requirement_level = RequirementLevel.find(params[:id])
---
SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)

  def edit
    @requirement_level = RequirementLevel.find(params[:id])
---
SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)

  def create
    @requirement_level = RequirementLevel.new(params[:requirement_level])

    respond_to do |format|
      if @requirement_level.save
---
INSERT INTO `requirement_levels` (`name`, `updated_at`, `abbreviation`, `created_at`) VALUES(NULL, '2010-03-01 00:05:48', '', '2010-03-01 00:05:48')

  def update
    @requirement_level = RequirementLevel.find(params[:id])

    respond_to do |format|
      if @requirement_level.update_attributes(params[:requirement_level])
---
SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)
UPDATE `requirement_levels` SET `name` = 'Software Requirements Specification', `updated_at` = '2010-02-26 03:42:18' WHERE `id` = 2

  def destroy
    @requirement_level = RequirementLevel.find(params[:id])
    @requirement_level.destroy
---
SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)
DELETE FROM `requirement_levels` WHERE `id` = 1