app/controllers/admin/requirement_types_controller.rb

  def index
    @requirement_types = RequirementType.all
---
SELECT * FROM `requirement_types`

  def show
    @requirement_type = RequirementType.find(params[:id])
---
SELECT * FROM `requirement_types` WHERE (`requirement_types`.`id` = 980190962)

  def edit
    @requirement_type = RequirementType.find(params[:id])
---
SELECT * FROM `requirement_types` WHERE (`requirement_types`.`id` = 980190962)

  def create
    @requirement_type = RequirementType.new(params[:requirement_type])

    respond_to do |format|
      if @requirement_type.save
---
INSERT INTO `requirement_types` (`name`, `updated_at`, `created_at`) VALUES(NULL, '2010-03-01 00:05:48', '2010-03-01 00:05:48')

  def update
    @requirement_type = RequirementType.find(params[:id])
---
SELECT * FROM `requirement_types` WHERE (`requirement_types`.`id` = 980190962)

  def destroy
    @requirement_type = RequirementType.find(params[:id])
    @requirement_type.destroy
---
SELECT * FROM `requirement_types` WHERE (`requirement_types`.`id` = 980190962)
DELETE FROM `requirement_types` WHERE `id` = 980190962