app/controllers/environments_controller.rb

SELECT * FROM `environments`
---
  def index
    @environments = Environment.all

SELECT * FROM `environments` WHERE (`environments`.`id` = 980190962)
---
  def show
    @environment = Environment.find(params[:id])

SELECT * FROM `environments` WHERE (`environments`.`id` = 980190962)
---
  def edit
    @environment = Environment.find(params[:id])

INSERT INTO `environments` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-03-01 01:54:31', NULL, '2010-03-01 01:54:31')
---
  def create
    @environment = Environment.new(params[:environment])

    respond_to do |format|
      if @environment.save

SELECT * FROM `environments` WHERE (`environments`.`id` = 980190962)
---
  def update
    @environment = Environment.find(params[:id])

SELECT * FROM `environments` WHERE (`environments`.`id` = 980190962)
DELETE FROM `environments` WHERE `id` = 980190962
---
  def destroy
    @environment = Environment.find(params[:id])
    @environment.destroy

SELECT * FROM `environments` WHERE (`environments`.`id` = 1)
---
  def factor_griddata
    @environment = Environment.find(params[:id])

SELECT * FROM `environment_config_factors` WHERE (`environment_config_factors`.`environment_id` = 1) ORDER BY created_at desc LIMIT 0, 0
---

    # No search terms provided
    if (query == "%%")
      @factors = EnvironmentConfigFactor.find_all_by_environment_id(@environment.id,
                                                                    :order => sortname+' '+sortorder,
                                                                    :limit =>rp,
                                                                    :offset =>start)