app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    @products = Product.all

SELECT * FROM `products` WHERE (`products`.`id` = 980604835)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 980604835)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`name`, `updated_at`, `jira_defect_filter`, `req_breakdown_id`, `identifier`, `created_at`) VALUES(NULL, '2010-03-01 00:05:49', NULL, NULL, NULL, '2010-03-01 00:05:49')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 980604835)
---
  def update
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 980604835)
DELETE FROM `products` WHERE `id` = 980604835
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy