app/controllers/quality_risks_controller.rb

SELECT * FROM `quality_risks` WHERE (`quality_risks`.product_id = 1)
---
  def index
    @quality_risks = QualityRisk.all