app/controllers/quality_risks_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def index
    @product = Product.find(params[:product_id])

SELECT * FROM `quality_risks` WHERE (`quality_risks`.`id` = 980190962)
---
  def show
    @quality_risk = QualityRisk.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def new
    @product = Product.find(params[:product_id])

SELECT * FROM `quality_risks` WHERE (`quality_risks`.`id` = 980190962)
---
  def edit
    @quality_risk = QualityRisk.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
INSERT INTO `quality_risks` (`product_id`, `risk_category_id`, `description`, `mitigation_strategy_id`, `explanation`, `likelihood`, `impact`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-02-25 00:32:26', '2010-02-25 00:32:26')
---
  def create
    @product = Product.find(params[:product_id])
    @quality_risk = QualityRisk.new(params[:quality_risk])
    @quality_risk.product = @product

    respond_to do |format|
      if @quality_risk.save

SELECT * FROM `quality_risks` WHERE (`quality_risks`.`id` = 980190962)
UPDATE `quality_risks` SET `explanation` = 'We need to test this dfsadf', `updated_at` = '2010-02-25 00:07:56' WHERE `id` = 1
---
  def update
    @quality_risk = QualityRisk.find(params[:id])

    respond_to do |format|
      if @quality_risk.update_attributes(params[:quality_risk])

SELECT * FROM `quality_risks` WHERE (`quality_risks`.`id` = 980190962)
DELETE FROM `quality_risks` WHERE `id` = 980190962
---
  def destroy
    @quality_risk = QualityRisk.find(params[:id])
    @product = @quality_risk.product
    @quality_risk.destroy