app/controllers/releases_controller.rb

  def index
    @product = Product.find(params[:product_id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def show
    @release = Release.find(params[:id])
---
SELECT * FROM `releases` WHERE (`releases`.`id` = 980190962)

  def edit
    @release = Release.find(params[:id])
---
SELECT * FROM `releases` WHERE (`releases`.`id` = 980190962)

  def create
    @product = Product.find(params[:product_id])
    @release = Release.new(params[:release])
    @release.product = @product

    respond_to do |format|
      if @release.save
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
INSERT INTO `releases` (`version`, `startdate`, `enddate`, `product_id`, `goal`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, 1, NULL, '2010-02-25 22:54:21', '2010-02-25 22:54:21')

  def update
    @release = Release.find(params[:id])

    respond_to do |format|
      if @release.update_attributes(params[:release])
---
SELECT * FROM `releases` WHERE (`releases`.`id` = 980190962)
UPDATE `releases` SET `goal` = 'To do some stuff 2', `updated_at` = '2010-02-24 23:51:17' WHERE `id` = 16

  def destroy
    @release = Release.find(params[:id])
    @product = @release.product
    @release.destroy
---
SELECT * FROM `releases` WHERE (`releases`.`id` = 980190962)
DELETE FROM `releases` WHERE `id` = 980190962