app/controllers/req_breakdowns_controller.rb

  def index
    @req_breakdowns = ReqBreakdown.all
---
SELECT * FROM `req_breakdowns`