app/controllers/req_breakdowns_controller.rb

  def index
    @req_breakdowns = ReqBreakdown.find_all_by_previous_breakdown_id(nil)
---
SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`previous_breakdown_id` IS NULL)

  def show
    @req_breakdown = ReqBreakdown.find(params[:id])
---
SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)

  def edit
    @req_breakdown = ReqBreakdown.find(params[:id])
---
SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)

  def create
    @req_breakdown = ReqBreakdown.new(params[:req_breakdown])

    respond_to do |format|
      if @req_breakdown.save
---
INSERT INTO `req_breakdowns` (`higher_level_id`, `lower_level_id`, `is_highest`, `is_lowest`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, NULL, '2010-02-21 23:20:27', '2010-02-21 23:20:27')

  def update
    @req_breakdown = ReqBreakdown.find(params[:id])
---
SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)

  def destroy
    @req_breakdown = ReqBreakdown.find(params[:id])
    @req_breakdown.destroy
---
SELECT * FROM `req_breakdowns` WHERE (`req_breakdowns`.`id` = 1)
DELETE FROM `req_breakdowns` WHERE `id` = 1