app/controllers/requirements_controller.rb

  def index
    @requirements = Requirement.all
---
SELECT * FROM `requirements` WHERE (requirement_level_id = 5 AND product_id = 2) ORDER BY created_at