app/controllers/requirement_levels_controller.rb

SELECT * FROM `requirement_levels`
---
  def index
    @requirement_levels = RequirementLevel.all

SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)
---
  def show
    @requirement_level = RequirementLevel.find(params[:id])

SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)
---
  def edit
    @requirement_level = RequirementLevel.find(params[:id])

INSERT INTO `requirement_levels` (`name`, `created_at`, `updated_at`, `abbreviation`) VALUES(NULL, '2010-02-26 02:03:54', '2010-02-26 02:03:54', NULL)
---
  def create
    @requirement_level = RequirementLevel.new(params[:requirement_level])

    respond_to do |format|
      if @requirement_level.save

SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)
---
  def update
    @requirement_level = RequirementLevel.find(params[:id])

SELECT * FROM `requirement_levels` WHERE (`requirement_levels`.`id` = 1)
DELETE FROM `requirement_levels` WHERE `id` = 1
---
  def destroy
    @requirement_level = RequirementLevel.find(params[:id])
    @requirement_level.destroy