app/controllers/requirement_reviews_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def index
    @product = Product.find(params[:product_id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def new
    @product = Product.find(params[:product_id])