app/controllers/requirements_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def index
    @product = Product.find(params[:product_id])

SELECT * FROM `requirements` WHERE (`requirements`.`id` = 980190962)
---
  def show
    @requirement = Requirement.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def new
    @product = Product.find(params[:product_id])

SELECT * FROM `requirements` WHERE (`requirements`.`id` = 980190962)
---
  def edit
    @requirement = Requirement.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
INSERT INTO `requirements` (`requirement_level_id`, `requirement_type_id`, `description`, `rationale`, `originator`, `fit_criterion`, `source_id`, `priority`, `satisfaction`, `dissatisfaction`, `created_at`, `updated_at`, `product_id`) VALUES(NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-02-25 00:32:27', '2010-02-25 00:32:27', NULL)
---
  def create
    @product = Product.find(params[:product_id])
    @requirement = Requirement.new(params[:requirement])
    @requirement.product = @product

    respond_to do |format|
      if @requirement.save

SELECT * FROM `requirements` WHERE (`requirements`.`id` = 980190962)
UPDATE `requirements` SET `requirement_type_id` = 2, `priority` = 5, `satisfaction` = 1, `dissatisfaction` = 1, `updated_at` = '2010-03-18 22:24:05' WHERE `id` = 1
---
  def update
    @requirement = Requirement.find(params[:id])

    respond_to do |format|
      if @requirement.update_attributes(params[:requirement])

SELECT * FROM `requirements` WHERE (`requirements`.`id` = 980190962)
DELETE FROM `requirements` WHERE `id` = 980190962
---
  def destroy
    @requirement = Requirement.find(params[:id])
    @product = @requirement.product
    @requirement.destroy