app/controllers/requirement_reviews_controller.rb

SELECT * FROM `requirement_reviews` WHERE (`requirement_reviews`.product_id = 1)
---
  def index
    @requirement_reviews = RequirementReview.all

SELECT * FROM `requirement_reviews` WHERE (`requirement_reviews`.`id` = 980190962)
---
  def show
    @requirement_review = RequirementReview.find(params[:id])

SELECT * FROM `requirement_reviews` WHERE (`requirement_reviews`.`id` = 980190962)
---
  def edit
    @requirement_review = RequirementReview.find(params[:id])

INSERT INTO `requirement_requirement_reviews` (`requirement_id`, `requirement_review_id`, `created_at`, `updated_at`) VALUES(1, 1, '2010-03-18 22:39:11', '2010-03-18 22:39:11')
INSERT INTO `requirement_reviews` (`updated_at`, `title`, `product_id`, `description`, `created_at`) VALUES('2010-03-01 00:05:49', NULL, NULL, NULL, '2010-03-01 00:05:49')
---
  def create
    @requirement_review = RequirementReview.new(params[:requirement_review])
    @product = @requirement_review.requirements[0].product

    respond_to do |format|
      if @requirement_review.save

SELECT * FROM `requirement_reviews` WHERE (`requirement_reviews`.`id` = 980190962)
---
  def update
    @requirement_review = RequirementReview.find(params[:id])

SELECT * FROM `requirement_reviews` WHERE (`requirement_reviews`.`id` = 980190962)
DELETE FROM `requirement_reviews` WHERE `id` = 980190962
---
  def destroy
    @requirement_review = RequirementReview.find(params[:id])
    @product = @requirement_review.requirements[0].product
    @requirement_review.destroy